In [3]:
import numpy  as np
import pandas as pd

In [4]:
titanic=pd.read_csv('https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/refs/heads/master/titanic.csv')
titanic.columns
#print(titanic)
print(titanic.info())
#print(titanic.describe())
#print((titanic['age']-29.881135)/14.413500)
titanic['age'].fillna(29.881135,inplace=True)
m=titanic['fare'].median()
titanic['fare'].fillna(m,inplace=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB
None

C:\Users\babav\AppData\Local\Temp\ipykernel_25852\3521877786.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['age'].fillna(29.881135,inplace=True)
C:\Users\babav\AppData\Local\Temp\ipykernel_25852\3521877786.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['fare'].fillna(m,inplace=True)

In [5]:
titanic['age'].fillna(29.881135,inplace=True)
titanic

C:\Users\babav\AppData\Local\Temp\ipykernel_25852\43937135.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['age'].fillna(29.881135,inplace=True)

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,NaN,S,0

In [6]:
titanic.isnull().sum()

pclass         0
name           0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           0
cabin       1014
embarked       2
survived       0
dtype: int64

In [7]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

In [8]:
titanic['embarked'].fillna(titanic['embarked'].mode,inplace=True)

In [9]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1309 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

In [10]:
titanic.drop(columns='cabin',inplace=True)

In [11]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   embarked  1309 non-null   object
 9   survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 102.4+ KB

FEATURE ENGINEERING

In [12]:
titanic[['lname','remaining']]=titanic['name'].str.split(',',expand=True)

titanic

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived,lname,remaining
0,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,S,1,Allison,Master. Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,S,0,Allison,Miss. Helen Loraine
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,S,0,Allison,Mr. Hudson Joshua Creighton
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,S,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,C,0,Zabour,Miss. Hileni
1305,3,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,14.4542,C,0,Zabour,Miss. Thamine
1306,3,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,C,0,Zakarian,Mr. Mapriededer
1307,3,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,C,0,Zakarian,Mr. Ortin
1308,3,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,S,0,Zimmerman,Mr. Leo

In [13]:
titanic['family_count']=titanic['sibsp']+titanic['parch']
titanic

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived,lname,remaining,family_count
0,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton,0
1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,S,1,Allison,Master. Hudson Trevor,3
2,1,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,S,0,Allison,Miss. Helen Loraine,3
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,S,0,Allison,Mr. Hudson Joshua Creighton,3
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,S,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels),3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,C,0,Zabour,Miss. Hileni,1
1305,3,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,14.4542,C,0,Zabour,Miss. Thamine,1
1306,3,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,C,0,Zakarian,Mr. Mapriededer,0
1307,3,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,C,0,Zakarian,Mr. Ortin,0
1308,3,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,S,0,Zimmerman,Mr. Leo,0

In [14]:
titanic.drop(columns=['sibsp','parch'],inplace=True)

titanic

,pclass,name,sex,age,ticket,fare,embarked,survived,lname,remaining,family_count
0,1,"Allen, Miss. Elisabeth Walton",female,29.000000,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton,0
1,1,"Allison, Master. Hudson Trevor",male,0.916700,113781,151.5500,S,1,Allison,Master. Hudson Trevor,3
2,1,"Allison, Miss. Helen Loraine",female,2.000000,113781,151.5500,S,0,Allison,Miss. Helen Loraine,3
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,113781,151.5500,S,0,Allison,Mr. Hudson Joshua Creighton,3
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,113781,151.5500,S,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels),3
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.500000,2665,14.4542,C,0,Zabour,Miss. Hileni,1
1305,3,"Zabour, Miss. Thamine",female,29.881135,2665,14.4542,C,0,Zabour,Miss. Thamine,1
1306,3,"Zakarian, Mr. Mapriededer",male,26.500000,2656,7.2250,C,0,Zakarian,Mr. Mapriededer,0
1307,3,"Zakarian, Mr. Ortin",male,27.000000,2670,7.2250,C,0,Zakarian,Mr. Ortin,0
1308,3,"Zimmerman, Mr. Leo",male,29.000000,315082,7.8750,S,0,Zimmerman,Mr. Leo,0

In [15]:
titanic['age_category']=pd.cut(titanic['age'],bins=[0,15,30,60,100],labels=['children','teenagers','adult','senior'])
titanic

,pclass,name,sex,age,ticket,fare,embarked,survived,lname,remaining,family_count,age_category
0,1,"Allen, Miss. Elisabeth Walton",female,29.000000,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton,0,teenagers
1,1,"Allison, Master. Hudson Trevor",male,0.916700,113781,151.5500,S,1,Allison,Master. Hudson Trevor,3,children
2,1,"Allison, Miss. Helen Loraine",female,2.000000,113781,151.5500,S,0,Allison,Miss. Helen Loraine,3,children
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,113781,151.5500,S,0,Allison,Mr. Hudson Joshua Creighton,3,teenagers
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,113781,151.5500,S,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels),3,teenagers
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.500000,2665,14.4542,C,0,Zabour,Miss. Hileni,1,children
1305,3,"Zabour, Miss. Thamine",female,29.881135,2665,14.4542,C,0,Zabour,Miss. Thamine,1,teenagers
1306,3,"Zakarian, Mr. Mapriededer",male,26.500000,2656,7.2250,C,0,Zakarian,Mr. Mapriededer,0,teenagers
1307,3,"Zakarian, Mr. Ortin",male,27.000000,2670,7.2250,C,0,Zakarian,Mr. Ortin,0,teenagers
1308,3,"Zimmerman, Mr. Leo",male,29.000000,315082,7.8750,S,0,Zimmerman,Mr. Leo,0,teenagers

finding Z score and outliers

In [16]:
z=(titanic['age']-29.881135)/14.413500
titanic[abs(z)>3]

,pclass,name,sex,age,ticket,fare,embarked,survived,lname,remaining,family_count,age_category
14,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,27042,30.000,S,1,Barkworth,Mr. Algernon Henry Wilson,0,senior
61,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,19877,78.850,S,1,Cavendish,Mrs. Tyrell William (Julia Florence Siegel),1,senior
1235,3,"Svensson, Mr. Johan",male,74.0,347060,7.775,S,0,Svensson,Mr. Johan,0,senior

In [17]:
titanic[['title','name']]=titanic['remaining'].str.split('.',n=1,expand=True)
titanic

,pclass,name,sex,age,ticket,fare,embarked,survived,lname,remaining,family_count,age_category,title
0,1,Elisabeth Walton,female,29.000000,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton,0,teenagers,Miss
1,1,Hudson Trevor,male,0.916700,113781,151.5500,S,1,Allison,Master. Hudson Trevor,3,children,Master
2,1,Helen Loraine,female,2.000000,113781,151.5500,S,0,Allison,Miss. Helen Loraine,3,children,Miss
3,1,Hudson Joshua Creighton,male,30.000000,113781,151.5500,S,0,Allison,Mr. Hudson Joshua Creighton,3,teenagers,Mr
4,1,Hudson J C (Bessie Waldo Daniels),female,25.000000,113781,151.5500,S,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels),3,teenagers,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,Hileni,female,14.500000,2665,14.4542,C,0,Zabour,Miss. Hileni,1,children,Miss
1305,3,Thamine,female,29.881135,2665,14.4542,C,0,Zabour,Miss. Thamine,1,teenagers,Miss
1306,3,Mapriededer,male,26.500000,2656,7.2250,C,0,Zakarian,Mr. Mapriededer,0,teenagers,Mr
1307,3,Ortin,male,27.000000,2670,7.2250,C,0,Zakarian,Mr. Ortin,0,teenagers,Mr
1308,3,Leo,male,29.000000,315082,7.8750,S,0,Zimmerman,Mr. Leo,0,teenagers,Mr

In [18]:
new_order=[8,9,7,2,11,1,10,3,0,4,5,6]
titanic[titanic.columns[new_order]]
titanic

,pclass,name,sex,age,ticket,fare,embarked,survived,lname,remaining,family_count,age_category,title
0,1,Elisabeth Walton,female,29.000000,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton,0,teenagers,Miss
1,1,Hudson Trevor,male,0.916700,113781,151.5500,S,1,Allison,Master. Hudson Trevor,3,children,Master
2,1,Helen Loraine,female,2.000000,113781,151.5500,S,0,Allison,Miss. Helen Loraine,3,children,Miss
3,1,Hudson Joshua Creighton,male,30.000000,113781,151.5500,S,0,Allison,Mr. Hudson Joshua Creighton,3,teenagers,Mr
4,1,Hudson J C (Bessie Waldo Daniels),female,25.000000,113781,151.5500,S,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels),3,teenagers,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,Hileni,female,14.500000,2665,14.4542,C,0,Zabour,Miss. Hileni,1,children,Miss
1305,3,Thamine,female,29.881135,2665,14.4542,C,0,Zabour,Miss. Thamine,1,teenagers,Miss
1306,3,Mapriededer,male,26.500000,2656,7.2250,C,0,Zakarian,Mr. Mapriededer,0,teenagers,Mr
1307,3,Ortin,male,27.000000,2670,7.2250,C,0,Zakarian,Mr. Ortin,0,teenagers,Mr
1308,3,Leo,male,29.000000,315082,7.8750,S,0,Zimmerman,Mr. Leo,0,teenagers,Mr

In [19]:
titanic.drop(axis=1,columns='remaining',inplace=True)
titanic

,pclass,name,sex,age,ticket,fare,embarked,survived,lname,family_count,age_category,title
0,1,Elisabeth Walton,female,29.000000,24160,211.3375,S,1,Allen,0,teenagers,Miss
1,1,Hudson Trevor,male,0.916700,113781,151.5500,S,1,Allison,3,children,Master
2,1,Helen Loraine,female,2.000000,113781,151.5500,S,0,Allison,3,children,Miss
3,1,Hudson Joshua Creighton,male,30.000000,113781,151.5500,S,0,Allison,3,teenagers,Mr
4,1,Hudson J C (Bessie Waldo Daniels),female,25.000000,113781,151.5500,S,0,Allison,3,teenagers,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,Hileni,female,14.500000,2665,14.4542,C,0,Zabour,1,children,Miss
1305,3,Thamine,female,29.881135,2665,14.4542,C,0,Zabour,1,teenagers,Miss
1306,3,Mapriededer,male,26.500000,2656,7.2250,C,0,Zakarian,0,teenagers,Mr
1307,3,Ortin,male,27.000000,2670,7.2250,C,0,Zakarian,0,teenagers,Mr
1308,3,Leo,male,29.000000,315082,7.8750,S,0,Zimmerman,0,teenagers,Mr

In [20]:
new_order=[11,8,1,3,2,4,5,6,9,10,0,7]
titanic[titanic.columns[new_order]]

,title,lname,name,age,sex,ticket,fare,embarked,family_count,age_category,pclass,survived
0,Miss,Allen,Elisabeth Walton,29.000000,female,24160,211.3375,S,0,teenagers,1,1
1,Master,Allison,Hudson Trevor,0.916700,male,113781,151.5500,S,3,children,1,1
2,Miss,Allison,Helen Loraine,2.000000,female,113781,151.5500,S,3,children,1,0
3,Mr,Allison,Hudson Joshua Creighton,30.000000,male,113781,151.5500,S,3,teenagers,1,0
4,Mrs,Allison,Hudson J C (Bessie Waldo Daniels),25.000000,female,113781,151.5500,S,3,teenagers,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,Miss,Zabour,Hileni,14.500000,female,2665,14.4542,C,1,children,3,0
1305,Miss,Zabour,Thamine,29.881135,female,2665,14.4542,C,1,teenagers,3,0
1306,Mr,Zakarian,Mapriededer,26.500000,male,2656,7.2250,C,0,teenagers,3,0
1307,Mr,Zakarian,Ortin,27.000000,male,2670,7.2250,C,0,teenagers,3,0
1308,Mr,Zimmerman,Leo,29.000000,male,315082,7.8750,S,0,teenagers,3,0

A) get the total no: of passangers

In [21]:
titanic.shape[0]

1309

In [22]:
titanic['name'].count()

np.int64(1309)

B) get the no: of tickets and its occurance

In [23]:
titanic['ticket'].value_counts()

ticket
CA. 2343        11
CA 2144          8
1601             8
347082           7
S.O.C. 14879     7
                ..
364511           1
364499           1
349216           1
383121           1
112050           1
Name: count, Length: 929, dtype: int64

In [24]:
titanic.value_counts(subset='ticket')

ticket
CA. 2343            11
CA 2144              8
1601                 8
S.O.C. 14879         7
347082               7
                    ..
SOTON/O2 3101272     1
STON/O2. 3101283     1
STON/O2. 3101282     1
STON/O2. 3101271     1
112050               1
Name: count, Length: 929, dtype: int64

In [25]:
titanic.groupb('ticket')['ticket'].count()

AttributeError: 'DataFrame' object has no attribute 'groupb'

C)get the no: of passangers who embarked in each port

In [ ]:
titanic.groupby('embarked')['embarked'].count()

D) get the no: of and female passangers

In [ ]:
titanic['sex'].value_counts()

E)get the no: of survival

In [ ]:
titanic['survived'].value_counts()[1]

In [76]:
titanic[titanic['survived']==1]['survived'].count()

np.int64(500)

In [ ]:
titanic['survived'].sum()

F)get the no: of male survivals

In [25]:
titanic[(titanic['sex']=='male') & (titanic['survived']==1)]['name'].count()

np.int64(161)

In [ ]:
titanic.groupby(['sex','survived'])['sex'].count().loc[('male',1)]

In [ ]:
titanic.groupby(['sex','survived']).get_group(('male',1))['sex'].count()

G)get the no: of passangers in each passenger class

In [49]:
titanic.groupby(['pclass'])['pclass'].count()

pclass
1    323
2    277
3    709
Name: pclass, dtype: int64

H)get the survival rate of pclass

In [50]:
titanic.groupby('pclass')['survived'].mean()

pclass
1    0.619195
2    0.429603
3    0.255289
Name: survived, dtype: float64

I)get the survival rate gender wise

In [51]:
titanic.groupby(['sex'])['survived'].mean()

sex
female    0.727468
male      0.190985
Name: survived, dtype: float64

J)get the traveller name who are travelling alone

In [52]:
titanic[titanic['family_count']==0]['survived'].mean()

np.float64(0.30253164556962026)

K)get the survival rate of those who travelled alone as well as with their family

In [81]:
def traveller_status(x):
    if x==0:
        return 'alone'
    else:
        return 'family'
a=titanic['family_count'].apply(traveller_status)
titanic.groupby(a)['survived'].mean()

family_count
alone     0.302532
family    0.502890
Name: survived, dtype: float64

In [80]:
a=titanic['family_count'].apply(lambda x:'alone' if x==0 else 'family')
titanic.groupby(a)['survived'].mean()

family_count
alone     0.302532
family    0.502890
Name: survived, dtype: float64

L)get the children name who did not survived

In [ ]:
titanic[(titanic['survived']==0)&(titanic['age_category']=='children')]['name']

M)get age category where survival rate is high

In [82]:
titanic.groupby('age_category')['survived'].mean().idxmax()

C:\Users\babav\AppData\Local\Temp\ipykernel_6176\2844653089.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby('age_category')['survived'].mean().idxmax()

'children'

N)get the gender wise survival rate of pclass ,age category,embarked (pivot)

In [177]:
titanic.columns

Index(['pclass', 'name', 'sex', 'age', 'ticket', 'fare', 'embarked',
       'survived', 'lname', 'family_count', 'age_category', 'title'],
      dtype='object')

In [ ]:
print(titanic.pivot_table(index='sex',columns=['pclass','age_category'],values='survived',aggfunc='mean',fill_value=0))

*****correlation

In [ ]:
titanic.corr(numeric_only=True)

********second highest max survival

In [187]:
g=titanic.groupby('ticket')['survived'].mean()
f_max=g.max()
g[g<f_max].idxmax()

'PC 17608'

O)get the ticket no: which has maximum survival rate

In [ ]:
titanic.groupby('pclass')['survived'].mean().idxmax()

P)get the ticket no: where the lots of travellers associated with

In [ ]:
titanic.groupby('ticket')['ticket'].count()

Q)get the survived rate in each category

In [ ]:
titanic.groupby('age_category')['survived'].mean()

R)total no: of male and female members

In [186]:
titanic['sex'].value_counts()

sex
male      843
female    466
Name: count, dtype: int64

S)get the passengers data if their family has high count

In [ ]:
titanic[titanic['family_count']==titanic['family_count'].max()]

T)find total fare for ticket ca.2343

In [57]:
titanic[titanic['ticket']=='CA.2343']['fare'].sum()

np.float64(0.0)

In [1]:
import seaborn as sna